#КОД ПРИМЕРА «Ветвления и оператор выбора»
#номер версии: 1.0
#имя файла: TA10.py
#автор и его учебная группа: A. nasreldin, ЭУ-135
#дата создания: 27.02.2021
#дата последней модификации: 04.03.2021
#описание: Ветвления и оператор выбора
#версия Python:3.9.2
#Дано натуральное число. Определить, будет ли это число: чётным, кратным 10.


a = 10.0
b = 10.0
c = 2.0
en = (10.0 / 2.0)
me = (10.0 / 7.0)
print("even -", en)
print("multiple -", me)

#результат
('even -', 5.0)
('multiple -', 1.4285714285714286)
