#КОД ПРИМЕРА «Ветвления и оператор выбора»
#номер версии: 1.0
#имя файла: TA12.py
#автор и его учебная группа: A. nasreldin, ЭУ-135
#дата создания: 27.02.2021
#дата последней модификации: 04.03.2021
#описание: Ветвления и оператор выбора
#версия Python:3.9.2
#Дано вещественное число. Определить, какое это число: положительное, отрицательное, ноль.


a = 45.0
if a > 0:
    print("positive")
else:
    print("negative")
if a == 0:
    print("equals zeroequals zero")

#результат
positive
