 КОД ПРИМЕРА «Линейные алгоритмы»
#номер версии: 1.0
#имя файла: TA2.py
#автор и его учебная группа: A. nasreldin, ЭУ-135
#дата создания: 27.02.2021
#дата последней модификации: 04.03.2021
#описание: Линейные алгоритмы
#версия Python:3.9.2
#Даны действительные числа А, В, С. Найти максимальное и минимальное из этих чисел.

A = 15
B = 8
C = 3
print("Max value: ", max(A, B, C))
print("Min value: ", min(A, B, C)) 

#результат
('Max value: ', 15)
('Min value: ', 3)
