#номер версии: 1.0
#имя файла: TA6.py
#автор и его учебная группа: A. nasreldin, ЭУ-135
#дата создания: 27.02.2021
#дата последней модификации: 04.03.2021
#описание: Линейные алгоритмы
#версия Python:3.9.2
#Определить значение функции Z=1/(XY) при X и Y не равных 0.

X = 3.0
Y = 5.0
Z = (1.0 / X * Y)
print("act -", Z)

# результат
('act -', 1.6666666666666665)
