#КОД ПРИМЕРА «Ветвления и оператор выбора»
#номер версии: 1.0
#имя файла: TA7.py
#автор и его учебная группа: A. nasreldin, ЭУ-135
#дата создания: 27.02.2021
#дата последней модификации: 04.03.2021
#описание: Ветвления и оператор выбора
#версия Python:3.9.2
#Дано натуральное число. Определить, будет ли это число: чётным, кратным 4.


a = 8.0
b = 4.0
c = 2.0
en = (8.0 / 2.0)
me = (8.0 / 4.0)
print("even -", en)
print("multiple -", me)

#результат
('even -', 4.0)
('multiple -', 2.0)
